TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0G3507/driverlib/uart_rx_hw_flow_control/uart_rx_hw_flow_control.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 */
// @cliArgs --device "MSPM0G350X" --package "LQFP-64(PM)" --part "Default"
// @cliArgs --board /ti/boards/LP_MSPM0G3507 --rtos nortos

/**
 * Import the modules used in this configuration.
 */
const UART   = scripting.addModule("/ti/driverlib/UART", {}, false);
const UART1  = UART.addInstance();

const SYSCTL = scripting.addModule("/ti/driverlib/SYSCTL");

/**
 * Write custom configuration values to the imported modules.
 */

UART1.$name = "UART_0";
UART1.profile = "CONFIG_PROFILE_3";
UART1.peripheral.$assign = "UART1";
UART1.targetBaudRate = 115200;
UART1.enableInternalLoopback = false;
UART1.enabledInterrupts = ["RX", "RX_TIMEOUT_ERROR"];
UART1.enableFIFO = true;
UART1.rxTimeoutValue = 15;
UART1.rxFifoThreshold = "DL_UART_RX_FIFO_LEVEL_3_4_FULL";

UART1.peripheral.rxPin.$assign = "PA9";
UART1.peripheral.txPin.$assign = "PA8";
UART1.peripheral.rtsPin.$assign = "PB9";
UART1.peripheral.ctsPin.$assign = "PB8";

SYSCTL.clockTreeEn = true;
